src/DataProcessors/ЗаданияНаОбновлениеИсполняющейЧасти/ЗаданияНаОбновлениеИсполняющейЧасти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаданияНаОбновлениеИсполняющейЧасти</name>
</mdclass:DataProcessor>

src/InformationRegisters/ЗадачиОбновленияСценариевАдминистрирования/ЗадачиОбновленияСценариевАдминистрирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиОбновленияСценариевАдминистрирования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТолькоПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатусКоманды</name>
    <type>
      <types>EnumRef.СтатусыКоманд</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДистрибутивWin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДистрибутивLin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДистрибутивPythonWin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДистрибутивPythonLin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Агент</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтурАдминистрирования</name>
    <type>
      <types>CatalogRef.КонтурыАдминистрирования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыКоманд/СтатусыКоманд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКоманд</name>
  <enumValues>
    <name>Сформирована</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ВыполненаСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/ЗаданияНаОбновлениеИсполняющейЧасти/Forms/ФормаСпискаЕдиницАдминистрирования/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициироватьПроверкуОбновлениеСценариевАдминистрирования(Команда)
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	ОбновлениеСценариевАдминистрированияНаСервере(МассивСтрок);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеСценариевАдминистрированияНаСервере(СтрокиАгентов)
	ПараметрыОбновления = Новый Структура("Агенты", СтрокиАгентов);
	ОткрытьФорму("Обработка.ЗаданияНаОбновлениеИсполняющейЧасти.Форма.ФормаВыбораПараметровОбновления", ПараметрыОбновления);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерезапуститьПоследнююЗадачуНаСервере(МассивСтрок)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗадачиОбновленияСценариевАдминистрированияСрезПоследних.Агент КАК Агент,
	                      |	МАКСИМУМ(ЗадачиОбновленияСценариевАдминистрированияСрезПоследних.Период) КАК Период
	                      |ИЗ
	                      |	РегистрСведений.ЗадачиОбновленияСценариевАдминистрирования.СрезПоследних(, Агент В (&СписокАгентов)) КАК ЗадачиОбновленияСценариевАдминистрированияСрезПоследних
	                      |
	                      |Сгруппировать ПО
	                      |	ЗадачиОбновленияСценариевАдминистрированияСрезПоследних.Агент");
	Запрос.УстановитьПараметр("СписокАгентов", МассивСтрок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ЗадачиОбновленияСценариевАдминистрирования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.Агент.Установить(Выборка.Агент);
		
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.СтатусКоманды = Перечисления.СтатусыКоманд.Сформирована;
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru='Обновление Агента'", Метаданные.ОсновнойЯзык.КодЯзыка), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьПоследнююЗадачу(Команда)
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	ПерезапуститьПоследнююЗадачуНаСервере(МассивСтрок);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Список.ТекущаяСтрока;
	Если ТекДанные <> Неопределено Тогда
		РаботаСоСценариямиАвтоматизацииКлиент.ИзменитьОтборДинамическогоСписка(ЗадачиОбновления, "Агент", ТекДанные);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// отбор по агенту
	ЭлементОтбораАгент = ЗадачиОбновления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораАгент.Использование = Истина;
	ЭлементОтбораАгент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораАгент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Агент");
	ЭлементОтбораАгент.ПравоеЗначение = ПредопределенноеЗначение("Справочник.АгентыКИП.ПустаяСсылка");
КонецПроцедуры

#КонецОбласти
